# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Outils système et réseau
brew 'openssh'
brew 'openssl'
brew 'rsync'
brew 'wget'
brew 'curl'
cask 'Cyberduck'
brew 'stormssh'
cask 'tunnelblick'
cask 'postman'

# Outils pour le terminal
cask 'iterm2'
brew 'autojump'
brew 'thefuck'

# Utilitaires
cask 'imageoptim'
cask 'coconutbattery'
cask 'disk-inventory-x'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'the-unarchiver'

# Outils de backup et synchro
brew 'mackup'
cask 'dropbox'
cask 'google-backup-and-sync'

# Outils Web
cask 'firefox'
cask 'google-chrome'
cask 'brave'

# Outils de développement
brew 'git'
cask 'java6'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
#brew 'xhyve'
#brew 'docker-machine-driver-xhyve'
cask 'vagrant'
cask 'vagrant-manager'
cask 'osxfuse'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Multimédia
brew 'ffmpeg'
cask 'handbrake'
#cask 'spotify' ? a voir deezer 
cask 'vlc'

# Communication
cask 'skype'

# Bureautique
brew 'pandoc'
cask 'flux'
cask 'poedit'
cask 'sublime-text'

# Divertissement

# Securite
#brew 'gpg2'
